Repository: zemogle/astroedu
Catalog: astroedu_wagtail/locale/*/LC_MESSAGES/django.po
Languages: el, fr, it

source: 404, Page not found.
el: 404, Η σελίδα δεν βρέθηκε.
fr: 404, Page non trouvée.
it: 404, pagina non trovata

source: Something went wrong.
el: Κάτι πήγε στραβά.
fr: Une erreur s’est produite.
it: Ops, qualcosa è andato storto

source: This site uses cookies to offer you a better browsing experience.
el: Αυτός ο ιστότοπος χρησιμοποιεί cookies για να σας προσφέρει καλύτερη εμπειρία περιήγησης.
fr: Ce site utilise des cookies pour vous offrir une meilleure expérience de navigation.
it: Questo sito usa dei cookies per offrirvi una migliore navigazione.

source: Read about how we use cookies.
el: Διαβάστε πώς χρησιμοποιούμε τα cookies.
fr: Découvrez comment nous utilisons les cookies.
it: Leggi come utilizziamo i cookies.

source: apply as volunteer
el: υποβολή αίτησης ως εθελοντής
fr: Proposez vous comme volontaire
it: candidati come volontario

source: Join us
el: Γίνετε μέλος μας
fr: Nous rejoindre
it: Unisciti a noi

source: Volunteer
el: Εθελοντής
fr: Bénévole
it: Volontari

source: Search
el: Αναζήτηση
fr: Rechercher
it: Cerca

source: Activity Collections
el: Συλλογές δραστηριοτήτων
fr: Collections d'activités
it: Attività a tema

source: See All Activities
el: Δείτε όλες τις δραστηριότητες
fr: Voir toutes les activités
it: Scopri tutte le attività

source: Submit Your Activities
el: Υποβάλετε τις δραστηριότητές σας
fr: Soumettre vos activités
it: Invia la tua attività

source: Submission
el: Υποβολή
fr: Soumettre
it: Inviare un'attività

source: Peer Review
el: Διαδικασία κρίσης
fr: Révision par les pairs
it: Revisione paritaria

source: Enquiry Based Learning
el: Διερευνητική μάθηση
fr: Apprentissage basé sur la démarche d'investigation
it: Modello di apprendimento

source: FAQ
el: Συχνές ερωτήσεις
it: Domande frequenti

source: About
el: Σχετικά
fr: À propos
it: Chi siamo

source: Brochure
el: Ενημερωτικό φυλλάδιο

source: Workflow
el: Ροή εργασιών
fr: Déroulé
it: Flusso di lavoro

source: News
el: Τα νέα μας
fr: Nouvelles
it: Notizie

source: Contact
el: Επικοινωνία
it: Contatti

source: Partners
el: Εταίροι
fr: Partenaires

source: Find Educational Activities
el: Βρείτε εκπαιδευτικές δραστηριότητες
fr: Trouver des activités pédagogiques
it: Trova attività didattiche

source: Black holes
el: Μαύρες τρύπες
fr: Trous Noirs
it: Buchi neri

source: Galaxies
el: Γαλαξίες
it: Galassie

source: Drawing
el: Σχέδιο
fr: Dessins
it: Disegni

source: Primary School
el: Πρωτοβάθμια εκπαίδευση
fr: École primaire
it: Scuola elementare

source: Peer-reviewed
el: Αξιολογημένο από ομοτίμους
fr: Revu par les pairs
it: attività didattiche peer-reviewed

source: astronomy education activities
el: εκπαιδευτικές δραστηριότητες αστρονομίας
fr: Activités pédagogiques d'astronomie
it: in astronomia

source: Coming Soon
el: Προσεχώς...
fr: Bientôt disponible

source: We are preparing a new edition of astroEDU. As soon as we have translations for activities they will appear here.
el: Ετοιμάζουμε μια νέα έκδοση του astroEDU. Μόλις έχουμε μεταφράσεις για τις δραστηριότητες θα εμφανιστούν εδώ.
fr: Nous préparons une nouvelle édition d'astroEDU. Dès que nous aurons les traductions des activités, elles apparaîtront ici.
